Tekla.Structures.ModelInternal.BimModelDataProduct.ModelUpdate
Represents an update to be applied to a model in the Structural Data Product.
All properties are optional; only the provided properties will be updated.
To restore deleted models, leave all properties null.

Tekla.Structures.ModelInternal.BimModelDataProduct.ModelUpdate.ModelName
Gets or sets the model name.

Tekla.Structures.ModelInternal.BimModelDataProduct.ModelUpdate.VersionId
Gets or sets the version of the model to the specified version identifier (rollback functionality).

Tekla.Structures.ModelInternal.BimModelDataProduct.ModelUpdate.Tags
Gets or sets a list of tags for categorizing the model.
IMPORTANT: Should include all tags, not just the changes.

Tekla.Structures.ModelInternal.BimModelDataProduct.ModelUpdate.Metadata
Gets or sets the model metadata for storing additional information about the model.
IMPORTANT: Should include all metadata, not just the changes.